# **START-UP FUNDING ANALYSIS IN THE INDIAN ECOSYSTEM**

**Project Description**

The Indian ecosystem is dynamic and constantly evolving, thus, for every business venturing into an unknown territory i.e., a new country or landscape, the fear of the unknown normally takes precedence with regards to whether the business will succeed or not. By examining existing data spanning from 2018 to 2021 on start-up funding, this project will identify key patterns, investment behaviors, and emerging sectors within the Indian start-up ecosystem to inform strategic decision-making for venturing into this market. 


**Task Outline**

- Analyze venture funding in India from 2018 t0 2021
- Carry out a comprehensive study of datasets,examining funding distributions,sector-specific details and focal geographic points in the Indian ecosystem.

**Hypothesis**

Null Hypothesis (H0) – The funds a company receives does not depend on the sector the company invests in.
 
Alternative Hypothesis (H1) – The funds a company receives depends on the sector a company invests in.


**Questions**

1. Does the location of a start-up influence the sector? 
2.	Which industries have received the most funding in each year, and how has this distribution changed over time? 
3.	What is the distribution of funding amounts among start-ups each year? 
4.	What are the average funding amounts for different funding stages (e.g., Seed, Series A, Series B, etc.) each y ear? 
5.	How does funding vary within the various geographical locations for start-ups?


# **1.DATA EXPLORATION,UNDERSTANDING AND ANALYSIS**

In [2]:
#Install all the necessary packages
#Import and load libraries

import pyodbc 
from dotenv import dotenv_values    #import the dotenv_values function from the dotenv package
import pandas as pd
import warnings
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
 
warnings.filterwarnings('ignore')

In [3]:
environment_variables = dotenv_values('.env')

# Load environment variables from .env file into a dictionaryenvironment_variables=dotenv_values('.env')
# Get the values for the credentials you set in the '.env' file
database=environment_variables.get("DATABASE")
server=environment_variables.get("SERVER")
username=environment_variables.get("LOGIN")
password=environment_variables.get("PASSWORD")
connection_string=f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password}"

In [4]:
# Create a connection string
connection=pyodbc.connect(connection_string)

In [5]:
# Sql query to access 2020 data 

query = ''' SELECT *
            FROM INFORMATION_SCHEMA.TABLES
            WHERE TABLE_TYPE = 'BASE TABLE' '''

In [6]:
indian=pd.read_sql(query, connection)
indian

  TABLE_CATALOG TABLE_SCHEMA               TABLE_NAME  TABLE_TYPE
0         dapDB          dbo  LP1_startup_funding2021  BASE TABLE
1         dapDB          dbo  LP1_startup_funding2020  BASE TABLE

In [7]:
#Load data for 2020

query= "SELECT * FROM dbo.LP1_startup_funding2020"
data_2020 =pd.read_sql(query, connection)

data_2020.head()

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
0,Aqgromalin,2019.0,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.0,None,None
1,Krayonnz,2019.0,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.0,Pre-seed,None
2,PadCare Labs,2018.0,Pune,Hygiene management,Converting bio-hazardous waste to harmless waste,Ajinkya Dhariya,Venture Center,NaN,Pre-seed,None
3,NCOME,2020.0,New Delhi,Escrow,Escrow-as-a-service platform,Ritesh Tiwari,"Venture Catalysts, PointOne Capital",400000.0,None,None
4,Gramophone,2016.0,Indore,AgriTech,Gramophone is an AgTech platform enabling acce...,"Ashish Rajan Singh, Harshit Gupta, Nishant Mah...","Siana Capital Management, Info Edge",340000.0,None,None

In [8]:
data_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1055 non-null   object
 1   Founded        842 non-null    float64
 2   HeadQuarter    961 non-null    object
 3   Sector         1042 non-null   object
 4   What_it_does   1055 non-null   object
 5   Founders       1043 non-null   object
 6   Investor       1017 non-null   object
 7   Amount         801 non-null    float64
 8   Stage          591 non-null    object
 9   column10       2 non-null      object
dtypes: float64(2), object(8)
memory usage: 82.5+ KB

In [9]:
data_2020.shape

(1055, 10)

In [10]:
#Load data for 2021

query= "SELECT * FROM dbo.LP1_startup_funding2021"
data_2021 =pd.read_sql(query, connection)

data_2021.head()

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",None
2,Lead School,2012.0,Mumbai,EdTech,LEAD School offers technology based school tra...,"Smita Deorah, Sumeet Mehta","GSV Ventures, Westbridge Capital","$30,000,000",Series D
3,Bizongo,2015.0,Mumbai,B2B E-commerce,Bizongo is a business-to-business online marke...,"Aniket Deb, Ankit Tomar, Sachin Agrawal","CDC Group, IDG Capital","$51,000,000",Series C
4,FypMoney,2021.0,Gurugram,FinTech,"FypMoney is Digital NEO Bank for Teenagers, em...",Kapil Banwari,"Liberatha Kallat, Mukesh Yadav, Dinesh Nagpal","$2,000,000",Seed

In [11]:
data_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1209 entries, 0 to 1208
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1209 non-null   object
 1   Founded        1208 non-null   float64
 2   HeadQuarter    1208 non-null   object
 3   Sector         1209 non-null   object
 4   What_it_does   1209 non-null   object
 5   Founders       1205 non-null   object
 6   Investor       1147 non-null   object
 7   Amount         1206 non-null   object
 8   Stage          781 non-null    object
dtypes: float64(1), object(8)
memory usage: 85.1+ KB

In [12]:
data_2021.shape

(1209, 9)

In [13]:
#Load CSV files
#Load 2018 data
data_2018 =pd.read_csv("C:\\Users\\User\\Desktop\\Jamaica\\Indian-Startup\\Data\\startup_funding2018.csv")
data_2018
data_2018.head(10)

,Company Name,Industry,Round/Series,Amount,Location,About Company
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India",A startup which aggregates milk from dairy far...
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India",Leading Online Loans Marketplace in India
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India",PayMe India is an innovative FinTech organizat...
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India",Eunimart is a one stop solution for merchants ...
5,Hasura,"Cloud Infrastructure, PaaS, SaaS",Seed,1600000,"Bengaluru, Karnataka, India",Hasura is a platform that allows developers to...
6,Tripshelf,"Internet, Leisure, Marketplace",Seed,"₹16,000,000","Kalkaji, Delhi, India",Tripshelf is an online market place for holida...
7,Hyperdata.IO,Market Research,Angel,"₹50,000,000","Hyderabad, Andhra Pradesh, India",Hyperdata combines advanced machine learning w...
8,Freightwalla,"Information Services, Information Technology",Seed,—,"Mumbai, Maharashtra, India",Freightwalla is an international forwarder tha...
9,Microchip Payments,Mobile Payments,Seed,—,"Bangalore, Karnataka, India",Microchip payments is a mobile-based payment a...

In [14]:
#Load 2019 data
data_2019 =pd.read_csv("C:\\Users\\User\\Desktop\\Jamaica\\Indian-Startup\\Data\\startup_funding2019.csv")
data_2019
data_2019.head(10)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.0,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C
2,Eduisfun,NaN,Mumbai,Edtech,It aims to make learning fun via games.,Jatin Solanki,"Deepak Parekh, Amitabh Bachchan, Piyush Pandey","$28,000,000",Fresh funding
3,HomeLane,2014.0,Chennai,Interior design,Provides interior designing solutions,"Srikanth Iyer, Rama Harinath","Evolvence India Fund (EIF), Pidilite Group, FJ...","$30,000,000",Series D
4,Nu Genes,2004.0,Telangana,AgriTech,"It is a seed company engaged in production, pr...",Narayana Reddy Punyala,Innovation in Food and Agriculture (IFA),"$6,000,000",NaN
5,FlytBase,NaN,Pune,Technology,A drone automation platform,Nitin Gupta,Undisclosed,Undisclosed,NaN
6,Finly,NaN,Bangalore,SaaS,It builds software products that makes work si...,"Vivek AG, Veekshith C Rai","Social Capital, AngelList India, Gemba Capital...",Undisclosed,NaN
7,Kratikal,2013.0,Noida,Technology,It is a product-based cybersecurity solutions ...,"Pavan Kushwaha, Paratosh Bansal, Dip Jung Thapa","Gilda VC, Art Venture, Rajeev Chitrabhanu.","$1,000,000",Pre series A
8,Quantiphi,NaN,NaN,AI & Tech,It is an AI and big data services company prov...,Renuka Ramnath,Multiples Alternate Asset Management,"$20,000,000",Series A
9,Lenskart,2010.0,Delhi,E-commerce,It is a eyewear company,"Peyush Bansal, Amit Chaudhary, Sumeet Kapahi",SoftBank,"$275,000,000",Series G

# **2.EXPLORATORY DATA ANALYSIS(EDA)**
 **EDA For 2018 Dataset**

In [15]:
#EDA with the 2018 dataset
#Preview the rows and columns for this dataset
 
data_2018.sample(5)

,Company Name,Industry,Round/Series,Amount,Location,About Company
393,Asset Reconstruction Company (India) Ltd.,"Financial Services, Professional Services",Secondary Market,—,"Mumbai, Maharashtra, India",Asset Reconstruction Company (India) Ltd. oper...
130,BYJU’S,"EdTech, Education, Higher Education, Secondary...",Private Equity,"$540,000,000","Bangalore, Karnataka, India",BYJU’s is an edtech company that is reinventin...
350,Career Anna,"Commercial, E-Learning, Education",Seed,"₹40,000,000","Bangalore, Karnataka, India",India's Go to Career Commerce Portal
229,WOTU,Food and Beverage,Seed,—,"Bangalore, Karnataka, India",It operates a business-to-business e-commerce ...
192,Placio,"Hospitality, Real Estate",Seed,2000000,"Noida, Uttar Pradesh, India",Placio is a student housing and a complete bro...

In [16]:
#Now, we check for information on the datatypes
data_2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   526 non-null    object
 1   Industry       526 non-null    object
 2   Round/Series   526 non-null    object
 3   Amount         526 non-null    object
 4   Location       526 non-null    object
 5   About Company  526 non-null    object
dtypes: object(6)
memory usage: 24.8+ KB

In [17]:
#Moving on to find the number of rows and columns
data_2018.shape

(526, 6)

In [18]:
#Information on the number of rows and columns
print(f"There are {data_2018.shape[0]}rows, and {data_2018.shape[1]}columns")

There are 526rows, and 6columns

In [19]:
#Finding missing values
data_2018.isnull().sum()

Company Name     0
Industry         0
Round/Series     0
Amount           0
Location         0
About Company    0
dtype: int64

In [20]:
#Finding duplicated values
data_2018.duplicated()
data_2018.duplicated().sum()

1

In [21]:
#Finally,describe the data for this set
data_2018.describe()

,Company Name,Industry,Round/Series,Amount,Location,About Company
count,526,526,526,526,526,526
unique,525,405,21,198,50,524
top,TheCollegeFever,—,Seed,—,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
freq,2,30,280,148,102,2

 **EDA For 2019 Dataset**

In [22]:
#EDA with the 2019 dataset
#Preview the rows and columns for this dataset
 
data_2019.sample(5)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
87,Spinny,2015.0,Delhi,Automobile,Online car retailer,"Niraj Singh, Ramanshu Mahaur, Ganesh Pawar, Mo...","Norwest Venture Partners, General Catalyst, Fu...","$50,000,000",NaN
60,Ecom Express,2012.0,Gurugram,Logistics,It is a technology enabled logistics solutions...,"Krishnan, Manju Dhawan, K Satyanarayana, Sanje...",CDC Group,"$36,000,000",NaN
3,HomeLane,2014.0,Chennai,Interior design,Provides interior designing solutions,"Srikanth Iyer, Rama Harinath","Evolvence India Fund (EIF), Pidilite Group, FJ...","$30,000,000",Series D
24,Medlife,2014.0,Bangalore,Pharmaceutical,It solves inadequacies in the healthcare deliv...,"Tushar Kumar, Prashant Singh",Wilson Global Opportunities Fund,"$15,500,000",NaN
74,Credr,2014.0,Mumbai,Automobile,A marketplace to buy and sell used bikes and s...,Mittal,"Omidyar Network, Eight Roads Ventures, GrowthS...","$6,000,000",NaN

In [23]:
#Now, we check for information on the datatypes
data_2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        60 non-null     float64
 2   HeadQuarter    70 non-null     object
 3   Sector         84 non-null     object
 4   What it does   89 non-null     object
 5   Founders       86 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     object
 8   Stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

In [24]:
#Moving on to find the number of rows and columns
data_2019.shape

(89, 9)

In [25]:
#Information on the number of rows and columns
print(f"There are {data_2019.shape[0]}rows, and {data_2019.shape[1]}columns")

There are 89rows, and 9columns

In [26]:
#Finding missing values
data_2019.isnull().sum()

Company/Brand     0
Founded          29
HeadQuarter      19
Sector            5
What it does      0
Founders          3
Investor          0
Amount($)         0
Stage            46
dtype: int64

In [27]:
#Finding duplicated values
data_2019.duplicated()
data_2019.duplicated().sum()

0

In [28]:
#Finally,describe the data for this set
data_2019.describe()

           Founded
count    60.000000
mean   2014.533333
std       2.937003
min    2004.000000
25%    2013.000000
50%    2015.000000
75%    2016.250000
max    2019.000000

**EDA For 2020 Dataset**

In [29]:
#EDA with the 2020 dataset
#Preview the rows and columns for this dataset
 
data_2020.sample(5)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
163,iKure,2010.0,Kolkata,HealthTech,iKure is a social enterprise that delivers pri...,Sujay Santra,"Ratan Tata, Inflection Point Ventures, Ankur M...",NaN,None,None
992,Zoomcar,2013.0,Bangalore,Transport & Rentals,A car rental service platform,"Greg Moran, David Back",Sony Innovation Fund,30000000.0,Series D,None
832,Pitstop,NaN,Bangalore,Automobile,Doorstep car service,Mihir Mohan mishra,TPG-backed Group Landmark,2500000.0,Series A,None
18,Pine Labs,1998.0,Noida,FinTech,A merchant platform company that provides fina...,Amrish Rau,"Mastercard, Temasek Holdings",NaN,None,None
847,Ola Electric,NaN,Bangalore,eMobility,Electric vehicle,"Ankit Jain, Anand Shah",Pawan Munjal Family Trust Fund,1000000.0,None,None

In [30]:
#Now, we check for information on the datatypes
data_2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1055 non-null   object
 1   Founded        842 non-null    float64
 2   HeadQuarter    961 non-null    object
 3   Sector         1042 non-null   object
 4   What_it_does   1055 non-null   object
 5   Founders       1043 non-null   object
 6   Investor       1017 non-null   object
 7   Amount         801 non-null    float64
 8   Stage          591 non-null    object
 9   column10       2 non-null      object
dtypes: float64(2), object(8)
memory usage: 82.5+ KB

In [31]:
#Moving on to find the number of rows and columns
data_2020.shape

(1055, 10)

In [32]:
#Information on the number of rows and columns
print(f"There are {data_2020.shape[0]}rows, and {data_2020.shape[1]}columns")

There are 1055rows, and 10columns

In [33]:
#Finding missing values
data_2020.isnull().sum()

Company_Brand       0
Founded           213
HeadQuarter        94
Sector             13
What_it_does        0
Founders           12
Investor           38
Amount            254
Stage             464
column10         1053
dtype: int64

In [34]:
#Finding duplicated values
data_2020.duplicated()
data_2020.duplicated().sum()

3

In [35]:
#Finally,describe the data for this set
data_2020.describe()

           Founded        Amount
count   842.000000  8.010000e+02
mean   2015.363420  1.130430e+08
std       4.097909  2.476635e+09
min    1973.000000  1.270000e+04
25%    2014.000000  1.000000e+06
50%    2016.000000  3.000000e+06
75%    2018.000000  1.100000e+07
max    2020.000000  7.000000e+10

**EDA For 2021 Dataset**

In [36]:
#EDA with the 2021 dataset
#Preview the rows and columns for this dataset
 
data_2021.sample(5)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage
849,Rubix Data Sciences,2018.0,Mumbai,IT startup,Rubix Data Sciences focuses on simplifying dec...,Mohan Ramaswamy,None,"$800,000",Seed
896,Vayana Network,2017.0,Pune,Financial Services,Vayana Network is an electronic network that c...,Ramaswamy Iyer,"CDC Group, Jungle Ventures, March Capital, Mar...",$30000000,Series C
68,OfBusiness,2015.0,Gurugram,FinTech,OfBusiness is a financing platform that offers...,"Asish Mohapatra, Bhuvan Gupta, Chandranshu Sin...","Falcon Edge India, Norwest Venture Partners","$110,000,000",None
1202,Voxelgrids,2017.0,Bangalore,Deeptech,Voxelgrids is an Magnetic Resonance Imaging te...,Arjun Arunachalam,Zoho,$5000000,None
583,Green Soul,2016.0,Ambernath,Consumer Goods,Green Soul is No.1 brand on Amazon India in Er...,Ravi Khushwani,velocity.in,$200000,None

In [37]:
#Now, we check for information on the datatypes
data_2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1209 entries, 0 to 1208
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1209 non-null   object
 1   Founded        1208 non-null   float64
 2   HeadQuarter    1208 non-null   object
 3   Sector         1209 non-null   object
 4   What_it_does   1209 non-null   object
 5   Founders       1205 non-null   object
 6   Investor       1147 non-null   object
 7   Amount         1206 non-null   object
 8   Stage          781 non-null    object
dtypes: float64(1), object(8)
memory usage: 85.1+ KB

In [38]:
#Moving on to find the number of rows and columns
data_2021.shape

(1209, 9)

In [39]:
#Information on the number of rows and columns
print(f"There are {data_2021.shape[0]}rows, and {data_2021.shape[1]}columns")

There are 1209rows, and 9columns

In [40]:
#Finding missing values
data_2021.isnull().sum()

Company_Brand      0
Founded            1
HeadQuarter        1
Sector             0
What_it_does       0
Founders           4
Investor          62
Amount             3
Stage            428
dtype: int64

In [41]:
#Finding duplicated values
data_2021.duplicated()
data_2021.duplicated().sum()

19

In [42]:
#Finally,describe the data for this set
data_2021.describe()

           Founded
count  1208.000000
mean   2016.655629
std       4.517364
min    1963.000000
25%    2015.000000
50%    2018.000000
75%    2020.000000
max    2021.000000

**Issues Identified And Possible Solutions**                           

1. *Different Currencies in Amounts*:
   - *Issue*: Funding amounts are recorded in different currencies (e.g., INR, USD).
   - *Solution*: Normalize the amounts to a single currency using historical rates .

2. *Missing Data*:
   - *Issue*: Potential missing values in the datasets as indicated by the count of non-null entries.
   - *Solution*: Implement strategies for handling missing data such as imputation, filling with default values, or dropping missing entries.

3. *Column Consistency*:
   - *Issue*: Inconsistencies in column names across the datasets for different years.
   - *Solution*: Standardize column names across datasets to ensure consistency.

4. *Irrelevant columns*:
   - *Issue*: There are some irrelevant columns in the dataset 
   - *Solution*: Drop the irrelevant columns

5. *Inconsistent values  in categorical features*
   - *Issue*: Inconsistent values in categorical columns, for eg, stages and sectors.
   - *Solution*: Standardizing the values of the categorical features.

# **DATA CLEANING AND PREPARATION**

**Conversion of Indian Rupees to Dollars**

In [43]:
#Convert Indian rupee values in the 2018 dataset to dollars.
#Replace some unwanted symbols in Amount column
data_2018['Amount'] = data_2018['Amount'].str.replace(',', '').str.replace('—', '').str.replace("''",'').replace('', np.nan)

# Conditionally apply multiplication only where '₹' is present
mask = data_2018['Amount'].str.contains('₹', na=False)
data_2018.loc[mask, 'Amount'] = data_2018.loc[mask, 'Amount'].str.replace('₹', '').astype(float) * 0.0146

In [44]:
#Add the years each dataset was collected

data_2018['year'] = pd.to_datetime('2018', format='%Y').year
data_2019['year'] = pd.to_datetime('2019', format='%Y').year
data_2020['year'] = pd.to_datetime('2020', format='%Y').year
data_2021['year'] = pd.to_datetime('2021', format='%Y').year

In [49]:
#Concatenate the four datasets
def concat_dataframes(data,data1, data2, data3):
    """
    Concatenates four dataframes along the row axis.

    Parameters:
    data (pandas.DataFrame): The first dataframe to concatenate.
    data1 (pandas.DataFrame): The second dataframe to concatenate.
    data2 (pandas.DataFrame): The third dataframe to concatenate.
    data3 (pandas.DataFrame): The fourth dataframe to concatenate.

    Returns:
    pandas.DataFrame: The concatenated dataframe.
    """
    # Rename columns to make them consistent across dataframes
    df1 = data.rename(columns={'Company_Brand': 'company_brand', 'Founded': 'founded','HeadQuarter': 'headquarter','Sector': 'sector','What_it_does': 'about_company','Founders':'founders','Investor':'investor','Amount':'amount','Stage':'series', 'year' : 'year'})
    df2 = data1.rename(columns={'Company_Brand': 'company_brand', 'Founded': 'founded','HeadQuarter': 'headquarter','Sector': 'sector','What_it_does': 'about_company','Founders':'founders','Investor':'investor','Amount':'amount','Stage':'series','year' : 'year'})
    df3 = data2.rename(columns={'Company/Brand': 'company_brand', 'Founded': 'founded','HeadQuarter': 'headquarter','Sector': 'sector','What it does': 'about_company','Founders':'founders','Investor':'investor','Amount($)':'amount','Stage':'series','year' : 'year'})
    df4 = data3.rename(columns={'Company Name': 'company_brand','Location': 'headquarter','Industry': 'sector','About Company': 'about_company','Amount':'amount','Round/Series':'series','year' : 'year'})

    # Concatenate dataframes along the row axis
    result = pd.concat([df1, df2, df3,df4], axis=0).reset_index(drop=True)

    return result

In [50]:
df= concat_dataframes(data_2021,data_2020,data_2019,data_2018)

In [51]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2879 entries, 0 to 2878
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   company_brand  2879 non-null   object
 1   founded        2110 non-null   float64
 2   headquarter    2765 non-null   object
 3   sector         2861 non-null   object
 4   about_company  2879 non-null   object
 5   founders       2334 non-null   object
 6   investor       2253 non-null   object
 7   amount         2474 non-null   object
 8   series         1941 non-null   object
 9   year           2879 non-null   int64
 10  column10       2 non-null      object
dtypes: float64(1), int64(1), object(9)
memory usage: 247.5+ KB